Revit 2027 API
EnergyAnalysisDetailModel.GetAnalyticalSpaces Method
 The collection of analytical spaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EnergyAnalysisSpace> GetAnalyticalSpaces()
Public Function GetAnalyticalSpaces As IList(Of EnergyAnalysisSpace)
public:
IList<EnergyAnalysisSpace^>^ GetAnalyticalSpaces()
member GetAnalyticalSpaces : unit -> IList<EnergyAnalysisSpace>
Return Value
IList<EnergyAnalysisSpace>
 Returns the analytical spaces after model calculation.
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace